/*****************************************************************************
 *  File: app_selector_gui.c
 * 
 *  This file contains functions for performing the graphics interface tasks
 *  of the application selector.
 * 
 ****************************************************************************/
 
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <io.h>
#include <math.h>
#include "includes.h"
#include "app_selector_gui.h"
#include "alt_video_display/alt_video_display.h"
#include "alt_touchscreen/alt_touchscreen.h"
#include "app_selector.h"
#include "os_utils.h"
#include "webserver.h"

// Include the Interniche task priorities.
#include "ipport.h"

int InMainMenu;

struct IcmpMib {
   u_long   icmpInMsgs;          /* 1 - received icmp packets, including errors */
   u_long   icmpInErrors;        /* 2 - bad sums, bad len, etc. */
   u_long   icmpInDestUnreachs;  /* 3 - no comments for self explanitorys */
   u_long   icmpInTimeExcds;     /* 4 */
   u_long   icmpInParmProbs;     /* 5 */
   u_long   icmpInSrcQuenchs;    /* 6 */
   u_long   icmpInRedirects;     /* 7 */
   u_long   icmpInEchos;         /* 8 */
   u_long   icmpInEchoReps;      /* 9 */
   u_long   icmpInTimestamps;    /* 10 */
   u_long   icmpInTimestampReps; /* 11 */
   u_long   icmpInAddrMasks;     /* 12 */
   u_long   icmpInAddrMaskReps;  /* 13 */
   u_long   icmpOutMsgs;         /* 14 - total sent icmps, including errors */
   u_long   icmpOutErrors;       /* 15 - ICMP Layer errors ONLY (see rfc #1156) */
   u_long   icmpOutDestUnreachs; /* 16 */
   u_long   icmpOutTimeExcds;    /* 17 */
   u_long   icmpOutParmProbs;    /* 18 */
   u_long   icmpOutSrcQuenchs;   /* 19 */
   u_long   icmpOutRedirects;    /* 20 */
   u_long   icmpOutEchos;        /* 21 */
   u_long   icmpOutEchoReps;     /* 22 */
   u_long   icmpOutTimestamps;   /* 23 */
   u_long   icmpOutTimestampReps;/* 24 */
   u_long   icmpOutAddrMasks;    /* 25 */
   u_long   icmpOutAddrMaskReps; /* 26 */
};

extern struct IcmpMib icmp_mib;

extern OS_EVENT *TouchscreenSem;
extern OS_EVENT* As_WebserverStatusMbox;

void GuiTask( void* pdata )
{

  // This is our list of apps stored in flash
  app_list_struct* app_list;
  
  // This is our LCD display
  alt_video_display* display;
  
  // This is our LCD configuration port
  alt_tpo_lcd lcd_serial;

  // This is our touch panel
  alt_touchscreen touchscreen;            

  // Allocate our app list structure memory
  app_list = malloc( sizeof( app_list_struct ));

  // Initialize and start the LCD display
  display = alt_video_display_init( ALT_VIDEO_DISPLAY_SGDMA_NAME,         // char* sgdma_name
                                    ALT_VIDEO_DISPLAY_COLS,               // int width
                                    ALT_VIDEO_DISPLAY_ROWS,               // int height
                                    ALT_VIDEO_DISPLAY_COLOR_DEPTH,        // int color_depth
